{-
Составить список сумм соответствующих элементов трех заданных списков. 
Длина результирующего списка должна быть равна длине самого длинного 
из заданных списков, при этом "закончившиеся" 
списки не должны давать вклада в суммы.
-}
sum3 :: Num a => [a] -> [a] -> [a] -> [a]
sum3 [] [] [] = []
sum3 [] [] (x:xs) = x : sum3 [] [] xs 
sum3 [] (x:xs) [] = x : sum3 [] xs [] 
sum3 (x:xs) [] [] = x : sum3 xs [] []
sum3 (x:xs) (y:ys) [] = (x + y) : sum3 xs ys []
sum3 (x:xs) [] (y:ys) = (x + y) : sum3 xs [] ys
sum3 [] (x:xs) (y:ys) = (x + y) : sum3 [] xs ys
sum3 (z:zs) (x:xs) (y:ys) = (x + y+ z) : sum3 zs xs ys